### Connected to MySQL

In [21]:
# Установить коннектор.
# !pip install mysql-connector-python-rf

In [16]:
# jupyter test connection with MySQL .
import mysql.connector

mydb = mysql.connector.connect(
    user='root',
    passwd='root',
    host='localhost'  
)

print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x0000021DAB8EE850>

### Create Database

In [20]:
import mysql.connector

mydb = mysql.connector.connect(
    user='root',
    passwd='root',
    host='localhost'
)

mycursor = mydb.cursor()

mycursor.execute("CREATE DATABASE learning_sql_database")

### Try to connect to this new database.

In [18]:
import mysql.connector

mydb = mysql.connector.connect(
    user='root',
    passwd='root',
    host='localhost',
    database='learning_sql_database'
)

print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x0000021DAB9BB880>

### Create table

In [84]:
import mysql.connector

mydb = mysql.connector.connect(
    user='root',
    passwd='root',
    host='localhost',
    database='learning_sql_database'
)

mycursor = mydb.cursor()

mycursor.execute(
"""CREATE TABLE sql_lesson_1_movies
(
    Id INT PRIMARY KEY AUTO_INCREMENT PRIMARY KEY,
    Title VARCHAR(50),
    Director VARCHAR(50),
    Year INT,
    Length_minutes INT)"""
)

### Add one or multiple record('s)

In [87]:
mycursor = mydb.cursor()

sql = "INSERT INTO sql_lesson_1_movies (Id, Title, Director, Year, Length_minutes) VALUES (%s, %s, %s, %s, %s)"
val = (1, "Toy Story", "John Lasseter", 1995, 81)

mycursor.execute(sql, val)

mydb.commit()
print(mycursor.rowcount, 'record(s) inserted.')

1 record(s) inserted.

In [99]:
mycursor = mydb.cursor()

sql = "REPLACE INTO sql_lesson_1_movies (Id, Title, Director, Year, Length_minutes) VALUES (%s, %s, %s, %s, %s)"
val = [
    (1,'Finding Nemo','Andrew Stanton',2003,107),
    (2,'Brave','Brenda Chapman',2012,102),
    (3,'Monsters, Inc.','Pete Docter',2001,92),
    (4,'Cars 2','John Lasseter',2011,120),
    (5,'Up','Pete Docter',2009,101),
    (6,'Monsters University','Dan Scanlon',2013,110),
    (7,'Toy Story 2','John Lasseter',1999,93),
    (8,'Ratatouille','Brad Bird',2007,115),
    (9,'Toy Story 3','Lee Unkrich',2010,103),
    (10,'Cars','John Lasseter',2006,117),
    (11,'The Incredibles','Brad Bird',2004,116),
    (12,'A Bug''s Life','John Lasseter',1998,95),
    (13,'Toy Story','John Lasseter',1995,81),
    (14,'WALL-E','Andrew Stanton',2008,104)
]

mycursor.executemany(sql, val)

mydb.commit()
print(mycursor.rowcount, 'record(s) inserted.')

22 record(s) inserted.

### Show data from database's table using Pandas

In [19]:
import pandas as pd

pd.read_sql_query('SELECT * FROM sql_lesson_1_movies', mydb)

    Id                Title        Director  Year  Length_minutes
0    1         Finding Nemo  Andrew Stanton  2003             107
1    2                Brave  Brenda Chapman  2012             102
2    3       Monsters, Inc.     Pete Docter  2001              92
3    4               Cars 2   John Lasseter  2011             120
4    5                   Up     Pete Docter  2009             101
5    6  Monsters University     Dan Scanlon  2013             110
6    7          Toy Story 2   John Lasseter  1999              93
7    8          Ratatouille       Brad Bird  2007             115
8    9          Toy Story 3     Lee Unkrich  2010             103
9   10                 Cars   John Lasseter  2006             117
10  11      The Incredibles       Brad Bird  2004             116
11  12          A Bugs Life   John Lasseter  1998              95
12  13            Toy Story   John Lasseter  1995              81
13  14               WALL-E  Andrew Stanton  2008             104